ART-Badge/SDK/libraries/inc/peripheral/rtl876x_qdec.h
/**
*********************************************************************************************************
*               Copyright(c) 2016, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* \file     rtl876x_qdec.h
* \brief    The header file of the peripheral QDECODER driver.
* \details  This file provides all QDECODER firmware functions.
* \author   howie wang
* \date     2016-05-10
* \version  v1.0
* *********************************************************************************************************
*/


#ifndef _RTL876X_QDECODER_H_
#define _RTL876X_QDECODER_H_

#ifdef __cplusplus
extern "C" {
#endif


/**
 * \addtogroup  IO          Peripheral Drivers
 * \defgroup    QDEC        QDEC
 *
 * \brief       Manage the QDEC peripheral functions.
 *
 * \ingroup     IO
 */

/*============================================================================*
 *                         Includes
 *============================================================================*/
#include "rtl876x.h"

/*============================================================================*
 *                         Types
 *============================================================================*/

/**
 * \defgroup    QDEC_Exported_Types Init Params Struct
 *
 * \ingroup     QDEC
 */

/**
 * \brief       Qdecoder initialize parameters.
 *
 * \ingroup     QDEC_Exported_Types
 */
typedef struct
{
    uint16_t scanClockDiv;
    uint16_t debounceClockDiv;
    uint8_t axisConfigX;                /*!< Specifies the axis X function.
                                                  This parameter can be a value of ENABLE or DISABLE */
    uint8_t axisConfigY;                /*!< Specifies the axis Y function.
                                                  This parameter can be a value of ENABLE or DISABLE */
    uint8_t axisConfigZ;                /*!< Specifies the axis Z function.
                                                  This parameter can be a value of ENABLE or DISABLE */
    uint8_t autoLoadInitPhase;          /*!< Specifies Auto-load Initphase function .
                                                  This parameter can be a value of ENABLE or DISABLE */
    uint16_t counterScaleX;             /*!< Specifies the axis X conter scale.
                                                  This parameter can be a value of \ref QDEC_Axis_counter_Scale */
    uint16_t debounceEnableX;           /*!< Specifies the axis X debounce.
                                                  This parameter can be a value of \ref Qdec_Debounce */
    uint16_t debounceTimeX;             /*!< Specifies the axis X debounce time. */
    uint16_t initPhaseX;                /*!< Specifies the axis X function.
                                                  This parameter can be a value of \ref Qdec_init_phase */
    uint16_t counterScaleY;             /*!< Specifies the axis Y conter scale.
                                                  This parameter can be a value of \ref QDEC_Axis_counter_Scale */
    uint16_t debounceEnableY;           /*!< Specifies the axis Y debounce.
                                                  This parameter can be a value of \ref Qdec_Debounce */
    uint16_t debounceTimeY;             /*!< Specifies the axis Y debounce time. */
    uint16_t initPhaseY;                /*!< Specifies the axis Y function.
                                                  This parameter can be a value of \ref Qdec_init_phase */
    uint16_t counterScaleZ;             /*!< Specifies the axis Z conter scale.
                                                  This parameter can be a value of \ref QDEC_Axis_counter_Scale */
    uint16_t debounceEnableZ;           /*!< Specifies the axis Z debounce.
                                                  This parameter can be a value of \ref Qdec_Debounce */
    uint16_t debounceTimeZ;             /*!< Specifies the axis Z debounce time. */
    uint16_t initPhaseZ;                /*!< Specifies the axis Z function.
                                                  This parameter can be a value of \ref Qdec_init_phase */
} QDEC_InitTypeDef;


/*============================================================================*
 *                         Constants
 *============================================================================*/

/**
 * \defgroup    QDEC_Exported_Constants     Macro Definitions
 *
 * \ingroup     QDEC
 */

#define IS_QDEC_PERIPH(PERIPH) ((PERIPH) == QDEC)

/** \defgroup   QDEC_Interrupts_Definition  QDEC Interrupts Definition
 * \{
 * \ingroup     QDEC_Exported_Constants
 */
#define QDEC_X_INT_NEW_DATA                                   BIT(0)//get New data and state change
#define QDEC_X_INT_ILLEAGE                                    BIT(1)//illeage
#define QDEC_Y_INT_NEW_DATA                                   BIT(2)//get New data and state change
#define QDEC_Y_INT_ILLEAGE                                    BIT(3)//illeage
#define QDEC_Z_INT_NEW_DATA                                   BIT(4)//get New data and state change
#define QDEC_Z_INT_ILLEAGE                                    BIT(5)//illeage
/** \} */

#define IS_QDEC_INT_CONFIG(CONFIG) (((CONFIG) == QDEC_X_INT_NEW_DATA) || ((CONFIG) == QDEC_X_INT_ILLEAGE)\
                                    || ((CONFIG) == QDEC_Y_INT_NEW_DATA) || ((CONFIG) == QDEC_Y_INT_ILLEAGE)\
                                    || ((CONFIG) == QDEC_Z_INT_NEW_DATA) || ((CONFIG) == QDEC_Z_INT_ILLEAGE))

/** \defgroup   QDEC_Interrupts_Mask    QDEC Interrupts Mask
 * \{
 * \ingroup     QDEC_Exported_Constants
 */
#define QDEC_X_CT_INT_MASK                                   BIT(0)//get New data and state change
#define QDEC_X_ILLEAGE_INT_MASK                              BIT(4)//illeage
#define QDEC_Y_CT_INT_MASK                                   BIT(1)//get New data and state change
#define QDEC_Y_ILLEAGE_INT_MASK                              BIT(5)//illeage
#define QDEC_Z_CT_INT_MASK                                   BIT(2)//get New data and state change
#define QDEC_Z_ILLEAGE_INT_MASK                              BIT(6)//illeage
/** \} */

#define IS_QDEC_INT_MASK_CONFIG(CONFIG) (((CONFIG) == QDEC_X_CT_INT_MASK) || ((CONFIG) == QDEC_X_ILLEAGE_INT_MASK)\
                                         || ((CONFIG) == QDEC_Y_CT_INT_MASK) || ((CONFIG) == QDEC_Y_ILLEAGE_INT_MASK)\
                                         || ((CONFIG) == QDEC_Z_CT_INT_MASK) || ((CONFIG) == QDEC_Z_ILLEAGE_INT_MASK))
/** \defgroup   QDEC_Axis_counter_Scale     QDEC Axis Counter
 * \{
 * \ingroup     QDEC_Exported_Constants
 */
#define CounterScale_2_Phase                      true
#define CounterScale_1_Phase                      false
/** \} */

/** \defgroup   QDEC_Debounce QDEC Debounce
 * \{
 * \ingroup     QDEC_Exported_Constants
 */
#define Debounce_Enable                        true
#define Debounce_Disable                       false
/** \} */

/** \defgroup   QDEC_Manual_Phase   QDEC manual phase
 * \{
 * \ingroup     QDEC_Exported_Constants
 */

#define manualPhaseEnable                        true
#define manualPhaseDisable                       false
/** \} */

/** \defgroup   Qdec_Init_Phase     Qdec Init Phase
 * \{
 * \ingroup     QDEC_Exported_Constants
 */

#define phaseMode0                        0       //phase 00
#define phaseMode1                        1       //phase 01
#define phaseMode2                        2       //phase 10
#define phaseMode3                        3       //phase 11
/** \} */

/** \defgroup   QDEC_Clr_Flag   Qdec Clr Flag
 * \{
 * \ingroup     QDEC_Exported_Constants
 */
#define QDEC_CLR_ILLEGAL_CT_X                            ((uint32_t)(1 << 20))
#define QDEC_CLR_ILLEGAL_CT_Y                            ((uint32_t)(1 << 21))
#define QDEC_CLR_ILLEGAL_CT_Z                            ((uint32_t)(1 << 22))

#define QDEC_CLR_ACC_CT_X                                ((uint32_t)(1 << 16))
#define QDEC_CLR_ACC_CT_Y                                ((uint32_t)(1 << 17))
#define QDEC_CLR_ACC_CT_Z                                ((uint32_t)(1 << 18))

#define QDEC_CLR_ILLEGAL_INT_X                           ((uint32_t)(1 << 12))
#define QDEC_CLR_ILLEGAL_INT_Y                           ((uint32_t)(1 << 13))
#define QDEC_CLR_ILLEGAL_INT_Z                           ((uint32_t)(1 << 14))

#define QDEC_CLR_UNDERFLOW_X                             ((uint32_t)(1 << 8))
#define QDEC_CLR_UNDERFLOW_Y                             ((uint32_t)(1 << 9))
#define QDEC_CLR_UNDERFLOW_Z                             ((uint32_t)(1 << 10))

#define QDEC_CLR_OVERFLOW_X                              ((uint32_t)(1 << 4))
#define QDEC_CLR_OVERFLOW_Y                              ((uint32_t)(1 << 5))
#define QDEC_CLR_OVERFLOW_Z                              ((uint32_t)(1 << 6))

